Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: link:{mutinyapi}/io/smallrye/mutiny/Uni.html[`Uni<RestResponse>`] or link:{mutinyapi}/io/smallrye/mutiny/Uni.html[`Uni<Response>`]
ja_jp: link:{mutinyapi}/io/smallrye/mutiny/Uni.html[`Uni<RestResponse>`] または link:{mutinyapi}/io/smallrye/mutiny/Uni.html[`Uni<Response>`]

source: link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/PartType.html[`@PartType`] is used to aid in deserialization of the corresponding part of the request into the desired Java type. It is only required if you need to use a <<readers-writers,special body parameter type>> for that particular parameter.
ja_jp: link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/PartType.html[`@PartType`] を使用して、任意の Javav の型にリクエストの対応部分をデシリアライズする際の補助とします。特定のパラメーターに <<readers-writers,special body parameter type>> を使用する必要がある場合にのみ必要です。

source: link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/PartType.html[`@PartType`] is used to aid in deserialization of the corresponding part of the request into the desired Java type. It is only required if you need to use a xref:readers-writers[special body parameter type] for that particular parameter.
ja_jp: link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/PartType.html[@PartType] は、リクエストの対応する部分を希望するJava型にデシリアライズする際の補助として使用されます。これは、特定のパラメータに xref:readers-writers[特別なボディ・パラメータ型] を使用する必要がある場合にのみ必要です。

source: link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/PartType.html[`@PartType`] is used to aid in deserialization of the corresponding part of the request into the desired Java type. It is very useful when for example the corresponding body part is JSON and needs to be converted to a POJO.
ja_jp: link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/PartType.html[`@PartType`] は、リクエストの対応する部分を希望の Java タイプにデシリアライズする際に使用されます。たとえば、対応する本文部分が JSON であり、POJO に変換する必要がある場合に非常に便利です。

source: link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/RestPath.html[`@RestPath`] (or nothing)
ja_jp: リンク:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/RestPath.html`@RestPath` (または何もない)

source: link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/RestResponse.html[`RestResponse<?>`] or link:{jaxrsapi}/jakarta/ws/rs/core/Response.html[`Response`]
ja_jp: link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/RestResponse.html[`RestResponse<?>`] または link:{jaxrsapi}/jakarta/ws/rs/core/Response.html[`Response`]

source: link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/RestResponse.html[`RestResponse<?>`] or link:{jaxrsapi}/javax/ws/rs/core/Response.html[`Response`]
ja_jp: link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/RestResponse.html[`RestResponse<?>`] または link:{jaxrsapi}/javax/ws/rs/core/Response.html[`Response`]

source: link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/RestResponse.html[`RestResponse`] or link:{jaxrsapi}/jakarta/ws/rs/core/Response.html[`Response`]
ja_jp: link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/RestResponse.html[`RestResponse`] または link:{jaxrsapi}/jakarta/ws/rs/core/Response.html[`レスポンス`]

source: link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/RestResponse.html[`RestResponse`] or link:{jaxrsapi}/javax/ws/rs/core/Response.html[`Response`]
ja_jp: link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/RestResponse.html[`RestResponse`] または link:{jaxrsapi}/javax/ws/rs/core/Response.html[`Response`]

source: link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/multipart/FileUpload.html[`FileUpload`] provides access to various metadata of the uploaded file. If however all you need is a handle to the uploaded file, `java.nio.file.Path` or `java.io.File` could be used.
ja_jp: link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/multipart/FileUpload.html[`FileUpload`] はアップロードされたファイルのさまざまなメタデータへのアクセスを提供します。ただし、アップロードされたファイルへのハンドルだけが必要な場合は、 `java.nio.file.Path` または `java.io.File` を使用できます。

source: link:{rm_blocking_annotation}[`@Blocking`] will force the method to be executed on a worker thread pool. The default pool of worker threads is shared between all channels. Using `@Blocking("my-custom-pool")` you can configure channels with a custom thread pool. The configuration property `smallrye.messaging.worker.my-custom-pool.max-concurrency` specifies the maximum number of threads in the pool. You can read more on the blocking processing in link:{rm_blocking_docs}[SmallRye Reactive Messaging documentation].
ja_jp: リンク:{rm_blocking_annotation} [`@Blocking`] は、メソッドをワーカースレッドプールで強制的に実行します。 ワーカースレッドのデフォルトプールは、すべてのチャネル間で共有されます。 `@Blocking("my-custom-pool")` を使用すると、カスタムスレッドプールを使用してチャネルを設定できます。 設定プロパティー `smallrye.messaging.worker.my-custom-pool.max-concurrency` は、プール内のスレッドの最大数を指定します。 ブロッキング処理の詳細は、リンク:{rm_blocking_docs}[SmallRye Reactive Messaging のドキュメント] を参照してください。

source: list of hostnames
ja_jp: ホスト名のリスト

source: list of string
ja_jp: 文字列のリスト

source: logging
ja_jp: ロギング

source: low maintenance
ja_jp: メンテナンスコストが低い

source: low memory
ja_jp: 低メモリー

source: low startup time
ja_jp: 短い起動時間

source: lra-coordinator
ja_jp: LRAコーディネーター

source: macOS users can install Podman through https://brew.sh/[Homebrew]. Once you have set up `brew`, you can use the `brew install` command to install Podman and `docker-compose`:
ja_jp: macOS ユーザーは https://brew.sh/[Homebrew] から Podman をインストールできます。 `brew` をセットアップしたら、 `brew install` コマンドを使用して Podman と `docker-compose` をインストールできます。

source: make your entities extend `PanacheEntity` (optional if you are using the repository pattern)
ja_jp: エンティティが `PanacheEntity` を拡張するようにする（リポジトリパターンを使用している場合は非必須です）

source: manage and visualize `Continuous Testing`
ja_jp: 管理と可視化 `Continuous Testing`

source: markdown: This will display interperated markdown
ja_jp: markdown: これにより、解釈された Markdown が表示されます

source: master node should be set to the _primary endpoint_, and
ja_jp: マスターノードは _プライマリーエンドポイント_ に設定し、

source: maturity status, which could be `stable`, `preview` or `experimental`, evaluated by extension maintainers
ja_jp: エクステンションのメンテナーが評価する、 `stable`、 `preview`、 `experimental` のいずれかの成熟度状態。

source: may be empty
ja_jp: 空の場合があります。

source: may contain other expression, sections, etc.
ja_jp: 他の表現、セクションなどを含む場合があります。

source: may express opinions about advantages and drawbacks of the concept that you are explaining relative to different potential use cases or applications.
ja_jp: 説明しているコンセプトの長所と短所について、さまざまな潜在的なユースケースまたはアプリケーションと比較して意見を表明します。

source: merge vs. concatenation - https://smallrye.io/smallrye-mutiny/guides/merge-concat
ja_jp: マージ vs. 連結 - https://smallrye.io/smallrye-mutiny/guides/merge-concat

source: merge vs. concatenation - https://smallrye.io/smallrye-mutiny/latest/guides/merging-and-concatenating-streams/
ja_jp: マージ vs 連結 - https://smallrye.io/smallrye-mutiny/latest/guides/merging-and-concatenating-streams/

source: merged with the other extension codestarts configs
ja_jp: 他のエクステンション Codestart の設定とマージされます

source: methods that declare a return type of `CompletionStage`, `Uni`, or `Multi`
ja_jp: 戻り値の型として `CompletionStage`、 `Uni`、または `Multi` を宣言するメソッド

source: migrating existing code
ja_jp: 既存コードの移行

source: modular
ja_jp: モジュール式

source: mount the volume
ja_jp: ボリュームをマウントする

source: msg: lookup a translation key
ja_jp: msg: 翻訳キーを検索

source: must be static,
ja_jp: `static` でなければなりません

source: must not be `private`
ja_jp: `private` であってはなりません

source: must not return `void`.
ja_jp: `void` を返してはいけません

source: mutual TLS (mTLS)
ja_jp: 相互 TLS (mTLS)

source: name: The item (or file) name
ja_jp: name: アイテム (またはファイル) 名

source: namespace `global`, one part: `colors`
ja_jp: 名前空間 `global` , 1つのパーツ: `colors`

source: new Vert.x gRPC implementation on top of the existing HTTP server
ja_jp: 新しいVert.x gRPC実装で、既存のHTTPサーバー上に構築

source: ngrok provides a simple way to get started with the Quarkus Let's Encrypt ACME feature.
ja_jp: ngrok は、Quarkus Let's Encrypt ACME 機能を使い始めるための簡単な方法を提供します。

source: ngrok provides a simplified way of getting started with the Quarkus Let's Encrypt ACME feature.
ja_jp: ngrok を使用すると、容易に Quarkus Let's Encrypt ACME 機能を使い始めることができます。

source: ngrok uses Let's Encrypt and intercepts ACME challenges that the Quarkus application would otherwise handle.
ja_jp: ngrok は Let's Encrypt を使用しており、本来 Quarkus アプリケーションが処理するはずの ACME チャレンジを傍受します。

source: no namespace, one part: `name`
ja_jp: 名前空間がなし、1 つの部分: `name`

source: no namespace, two parts - `item`, `getLabels(1)`, the second part is a virtual method with name `getLabels` and params `1`
ja_jp: 名前空間なし、2つのパーツ - `item` , `getLabels(1)` 、2番目のパーツは、名前 `getLabels` と パラメーター `1` を持つ仮想メソッドです。

source: no namespace, two parts: `item`, `name`
ja_jp: 名前空間なし、2つの部分: `item` . `name`

source: no rewrites
ja_jp: 書き直しの必要がない

source: no support for native executables.
ja_jp: ネイティブ実行可能ファイルには対応していません。

source: notAvailable: No assistant implementation (like Chappie) is present.
ja_jp: notAvailable: アシスタントの実装 (Chappie など) が存在しません。

source: note that `RestClient.LITERAL` has to be passed as the last argument of the `installMockForType` method
ja_jp: `RestClient.LITERAL` は `installMockForType` メソッドの最後の引数として渡される必要があることに注意してください

source: nothing: Nothing will be displayed
ja_jp: nothing: 何も表示されません

source: notification: Content will in a notification
ja_jp: notification: 内容が通知に表示されます

source: old Vert.x gRPC implementation with a separate gRPC server (default)
ja_jp: 古いVert.xのgRPC実装で、gRPCサーバーを別に用意（デフォルト）

source: on Kubernetes, where it doesn't make sense to execute Flyway on every single replica. Instead it's desirable to execute it once and then start the actual application without Flyway. To support this use case, when generating manifests for Kubernetes the generated manifests contain a Kubernetes initialization `Job` for Flyway. The `Job` performs initialization and the actual `Pod`, will starts once the `Job` is successfully completed.
ja_jp: Kubernetes上では、すべてのレプリカでFlywayを実行することは意味がありません。 代わりに、Flywayを一度実行してから、Flywayなしで実際のアプリケーションを起動することが望ましいです。 このユースケースをサポートするために、Kubernetes用のマニフェストを生成するとき、生成されたマニフェストにはFlyway用のKubernetes初期化 `Job` が含まれます。 `Job` は初期化を実行し、 `Job` が正常に完了すると、実際の `Pod` が開始されます。

source: on tab Business Rule Task, set rule flow group to the FQCN value of the RuleUnit using the `unit:` prefix (`unit:org.acme.kogito.PersonUnit`)
ja_jp: ビジネス・ルール・タスクタブで、ルール・フロー・グループを `unit:` プレフィックス (`unit:org.acme.kogito.PersonUnit`) を用いたRuleUnitのFQCN値に設定します。

source: on tab Gateway, set conditions on sequence flow list
ja_jp: Gateway タブで、シーケンスフローリストの条件を設定します。

source: on tab Gateway, set the diverging direction for the gateway
ja_jp: Gateway タブで、ゲートウェイの分岐方向を設定します。

source: on tab I/O Parameters, set data input (map `person` process variable to input data with name `person`)
ja_jp: I/Oパラメータータブで、データ入力を設定します( `person` プロセス変数を `person` という名前の入力データにマップします)。

source: on tab I/O Parameters, set data input and output (map `person` process variable to input data with name `person` and same for data output)
ja_jp: I/Oパラメータータブで、データの入出力を設定します( `person` プロセス変数を `person` という名前の入力データにマップし、データの出力も同じにします)。

source: on tak User Task, set task name to `ChildrenHandling`
ja_jp: ユーザータスクで、タスク名を `ChildrenHandling` に設定します。

source: on the class containing reactive messaging methods - the methods from this class annotation with `@Blocking` will be executed on virtual thread, except if the annotation defines a pool name configured to use regular worker threads
ja_jp: リアクティブメッセージングメソッドを含むクラスで使用 - `@Blocking` を持つこのクラスアノテーションのメソッドは、通常のワーカースレッドを使用するように設定されたプール名がアノテーションによって定義されている場合を除き、仮想スレッドで実行されます。

source: on the tab Business Rule Task, set rule flow group to the FQCN value of the RuleUnit using the `unit:` prefix (`unit:org.acme.kogito.PersonUnit`)
ja_jp: ビジネス・ルール・タスクタブで、ルール・フロー・グループを `unit:` プレフィックス (`unit:org.acme.kogito.PersonUnit`) を用いた RuleUnit の FQCN 値に設定します。

source: on the tab Gateway, set conditions on sequence flow list
ja_jp: Gateway タブで、シーケンスフローリストの条件を設定します。

source: on the tab Gateway, set the diverging direction for the gateway
ja_jp: Gateway タブで、ゲートウェイの分岐方向を設定します。

source: on the tab I/O Parameters, set data input (map `person` process variable to input data with name `person`)
ja_jp: I/O パラメータータブで、データ入力を設定します(`person` プロセス変数を `person` という名前の入力データにマップします)。

source: on the tab I/O Parameters, set data input and output (map `person` process variable to input data with name `person` and same for data output)
ja_jp: I/O パラメータータブで、データの入出力を設定します (`person` プロセス変数を `person` という名前の入力データにマップし、データの出力も同じにします)。

source: on the tab User Task, set task name to `ChildrenHandling`
ja_jp: ユーザータスクのタブで、タスク名を `ChildrenHandling` に設定します。

source: one more method to the `KafkaStreamsPipeline` class which obtains the current state for a given key:
ja_jp: `KafkaStreamsPipeline` クラスに、与えられたキーの現在の状態を取得するメソッドをもう一つ追加しました:

source: one replica node should be set to the _reader endpoint_.
ja_jp: 1 つのレプリカノードを _リーダーエンドポイント_ に設定する必要があります。

source: only consider *client* calls by adding the `@ConstrainedTo(RuntimeType.CLIENT)` annotation to your provider.
ja_jp: プロバイダに `@ConstrainedTo(RuntimeType.CLIENT)` アノテーションを追加することで、 *クライアント* コールのみを考慮します。

source: only consider *client* calls by adding the `@ConstrainedTo(RuntimeType.CLIENT)` annotation to your provider;
ja_jp: プロバイダに `@ConstrainedTo(RuntimeType.CLIENT)` アノテーションを追加することで、 *クライアント* コールのみを考慮します。

source: only consider *server* calls by adding the `@ConstrainedTo(RuntimeType.SERVER)` annotation to your provider.
ja_jp: プロバイダに `@ConstrainedTo(RuntimeType.SERVER)` アノテーションを追加することで、 *サーバー* コールのみを考慮します。

source: only consider *server* calls by adding the `@ConstrainedTo(RuntimeType.SERVER)` annotation to your provider;
ja_jp: プロバイダに `@ConstrainedTo(RuntimeType.SERVER)` アノテーションを追加することで、 *サーバー* コールのみを考慮します。

source: open a browser and go to http://localhost:8080/legumes.html
ja_jp: ブラウザーを起動し、 http://localhost:8080/legumes.html にアクセスします。

source: open a browser to `http://localhost:8080/`
ja_jp: ブラウザで `http://localhost:8080/` を開きます

source: open a browser to `http://localhost:8080/fruits.html`
ja_jp: `http://localhost:8080/fruits.html` をブラウザで開く

source: open the `java.base.lang` module at runtime with the flag `--add-opens java.base/java.lang=ALL-UNNAMED`
ja_jp: 実行時に `--add-opens java.base/java.lang=ALL-UNNAMED` フラグをつけて `java.base.lang` モジュールを開く

source: openssl command for converting private key
ja_jp: 秘密鍵を変換するための openssl コマンド

source: openssl commands for generating keys
ja_jp: 鍵を生成するための openssl コマンド

source: or
ja_jp: あるいは

source: or <a href="https://gradle.org/" target="_blank">Gradle</a>
ja_jp: もしくは <a href="https://gradle.org/" target="_blank">Gradle</a> が必要です

source: or `quarkus-resteasy-qute` if you are using RESTEasy Classic:
ja_jp: RESTEasy Classicを使用している場合は、 `quarkus-resteasy-qute` :

source: or `quarkus-resteasy-reactive-qute` if you are using RESTEasy Reactive:
ja_jp: または、RESTEasy Reactiveを使用している場合は、 `quarkus-resteasy-reactive-qute` です:

source: or a global default can be configured, using
ja_jp: または、以下を使用してグローバルデフォルトに設定できます。

source: or alternatively:
ja_jp: またはその代わりに以下を実行してください。

source: or as a parameter in your method if you are in the `GraphQLApi` class, for instance:
ja_jp: または、 `GraphQLApi` クラスであれば、メソッドのパラメータとして使用します。例:

source: or for native:
ja_jp: またはネイティブの場合、

source: or if configuring the OTLP gRPC endpoint via JVM arguments:
ja_jp: または、JVM引数でOTLP gRPCエンドポイントを設定する場合:

source: or if configuring the tracer via environment variables:
ja_jp: または、環境変数でトレーサーを設定する場合:

source: or if you are using Jackson:
ja_jp: あるいはJackson を使用している場合は以下の通りです:

source: or if you do not have `LAMBDA_ROLE_ARN` already defined in this shell:
ja_jp: または、このシェルで既に `LAMBDA_ROLE_ARN` が定義されていない場合にはこうです。

source: or if you like it the good old way
ja_jp: または、昔ながらの方法が好みの場合

source: or on OpenShift:
ja_jp: あるいはOpenShift上では次を使用することができます:

source: or on Openshift:
ja_jp: あるいはOpenshift上の場合：

source: or set `enable.auto.commit` to true and annotate the consuming method with `@Acknowledgment(Acknowledgment.Strategy.NONE)`.
ja_jp: または、 `enable.auto.commit` を true に設定し、消費メソッドに `@Acknowledgment(Acknowledgment.Strategy.NONE)` のアノテーションを付けます。

source: or simply adding the following Maven dependency:
ja_jp: または、単に以下のMaven依存関係を追加するだけです:

source: or the asynchronous version of this bean, that is, `CompletionStage<QuarkusCqlSession>`;
ja_jp: この Bean ( `CompletionStage<QuarkusCqlSession>` ) の非同期バージョン;

source: or the reactive version of this bean, that is, `Uni<QuarkusCqlSession>`.
ja_jp: またはこの Bean のリアクティブバージョン (`Uni<QuarkusCqlSession>`)。

source: or to build a native executable:
ja_jp: また、ネイティブ実行可能ファイルのビルドも同様です。

source: or to have built the native executable using an in-container build.
ja_jp: または、コンテナ内ビルドでネイティブ実行可能ファイルをビルドすること。

source: or to use the Quarkus Dev mode, insert the following to the `quarkus-maven-plugin` configuration:
ja_jp: または、 `quarkus-maven-plugin` 設定に以下を注入して Quarkus 開発モードを使用します。

source: or with the secret retrieved from a xref:credentials-provider.adoc[CredentialsProvider], signature algorithm is `HS256`:
ja_jp: または、xref:credentials-provider.adoc[CredentialsProvider] から取得したシークレットを使用すると、署名アルゴリズムは `HS256` になります。

source: or with the secret retrieved from a xref:credentials-provider.adoc[CredentialsProvider]:
ja_jp: または、xref:credentials-provider.adoc[CredentialsProvider]: から取得したシークレットを使用します。

source: or, if you use the Gradle Kotlin DSL:
ja_jp: または、GradleのKotlin DSLを使用している場合:

source: original
ja_jp: オリジナル

source: other classes will automatically be configured with `JSON` schema type
ja_jp: その他のクラスは、自動的に `JSON` スキーマタイプで設定されます。

source: other files are copied.
ja_jp: 他のファイルはコピーされます。

source: otherwise you will get an `java.lang.AssertionError: No completion (or failure) event received in the last 10000 ms` in <4>
ja_jp: 設定しない場合、<4> で `java.lang.AssertionError: No completion (or failure) event received in the last 10000 ms` が表示す。

source: overload detection
ja_jp: 過負荷検出

source: package book_sample; message Book { required string title = 1; required string description = 2; required int32 publicationYear = 3; // no native Date type available in Protobuf repeated Author authors = 4; requited double price = 5; // no native BigDecimal type available in Protobuf but you can use the adapter } message Author { required string name = 1; required string surname = 2; }
ja_jp: package book_sample; message Book { required string title = 1; required string description = 2; required int32 publicationYear = 3; // Protobuf ではネイティブの Date 型を利用できません repeated Author authors = 4; requited double price = 5; // Protobuf ではネイティブの BigDecimal 型を利用できませんが、アダプターを使用できます } message Author { required string name = 1; required string surname = 2; }

source: parser
ja_jp: パーサー

source: passes a continuation (the code to call when the I/O completes),
ja_jp: 継続（I/O が完了したときに呼び出すコード）を渡します、

source: path: The full path to that item (or file)
ja_jp: path: そのアイテム (またはファイル) への完全パス

source: per weather station the min, max and average temperature is determined
ja_jp: 各気象観測所ごとに最低、最高、平均気温が決定されます

source: per-client proxy settings, with `quarkus.rest-client.<my-client>.proxy-address`, etc. These are applied only to clients injected with CDI, that is the ones created with `@RegisterRestClient`
ja_jp: `quarkus.rest-client.<my-client>.proxy-address` などのクライアントごとのプロキシー設定です。これらは、CDI で挿入されたクライアント、つまり `@RegisterRestClient` で作成されたクライアントに対してのみ適用されます。

source: performing entity validation on lifecycle events
ja_jp: ライフサイクルイベント時のエンティティーバリデーションの実行

source: periodic-tasks
ja_jp: 定期的なタスク

source: point-to-point - send the message, one consumer receives it. If several consumers listen to the address, a round robin is applied;
ja_jp: point-to-point - メッセージを送信し、1 つのコンシューマがそれを受信します。複数のコンシューマがアドレスをリスンしている場合、ラウンドロビンが適用されます。

source: point-to-point - send the message, one consumer receives it. If several consumers listen to the address, a round-robin is applied;
ja_jp: point-to-point - メッセージを送信し、1 つのコンシューマーがそのメッセージを受信します。複数のコンシューマーがアドレスで待ち受けている場合、ラウンドロビンが適用されます。

source: possibly includes the <<platform-properties,platform configuration properties>> artifacts
ja_jp: <<platform-properties,プラットフォーム設定プロパティ>> アーティファクトを含む場合があります

source: possibly includes the xref:platform-properties[platform configuration properties] artifacts
ja_jp: ことによると xref:platform-properties[プラットフォーム設定プロパティ] のアーティファクトを含むこと

source: postgres
ja_jp: PostgreSQL

source: primitive types or `String`
ja_jp: プリミティブ型または `文字列`

source: primitive types or `UUID`/`String`
ja_jp: プリミティブ型または `UUID`/`String`

source: primitives or `String`,
ja_jp: プリミティブまたは `String`

source: priority load shedding (optional)
ja_jp: 優先負荷制限 (オプション)

source: project: The project skeleton (e.g. a Quarkus project)
ja_jp: project: プロジェクトの骨組（例：Quarkusプロジェクト）

source: provide a learning experience, giving the reader something they can do.
ja_jp: 読者に学習体験を提供し、できることを与えます。

source: provide background information and context to explain _why_ things work the way they do, or why they are built in a particular way. You can cite design decisions, historical reasons, and technical constraints to reaffirm your points.
ja_jp: そのように動作する _理由_ や、特定の方法でビルドされた _理由_ を説明する背景情報やコンテキストを提供します。設計上の決定事項、歴史的な理由、技術的な制約などを引用して、自分の主張を再確認できます。

source: provide background information and context to explain _why_ things work the way they do, or why they are built the way they are. You can cite design decisions, historical reasons, and technical constraints to reaffirm your points.
ja_jp: そのように動作する _理由_ や、特定の方法でビルドされた _理由_ を説明する背景情報やコンテキストを提供します。設計上の決定事項、歴史的な理由、技術的な制約などを引用して、ポイントを再確認できます。

source: provide examples or illustrations that help readers understand what is being described.
ja_jp: 説明している内容を読者が理解できるように、例やイラストを提供します。

source: provide feedback on https://github.com/quarkusio/quarkus/issues[GitHub];
ja_jp: https://github.com/quarkusio/quarkus/issues[GitHub] でフィードバック

source: provide the reader with concrete steps to follow that each have a comprehensible result.
ja_jp: 読者が従う必要があり、わかりやすい結果をもたらす、具体的な手順を提供します。

source: provided capability name
ja_jp: 提供されたケイパビリティ名

source: proxy
ja_jp: プロキシー

source: publish/subscribe - publish a message, all the consumers listening to the address are receiving the message;
ja_jp: publish/subscribe - メッセージを発行し、アドレスで待ち受けているすべてのコンシューマーがメッセージを受信します。

source: publish/subscribe - publish a message; all the consumers listening to the address are receiving the message;
ja_jp: publish/subscribe - メッセージを発行し、そのアドレスを聞いているすべてのコンシューマーがメッセージを受信します。

source: quarkus update
ja_jp: Quarkusアップデート

source: quarkus { cachingRelevantProperties.add("FOO_MESSAGE") // Note: `cachingRelevantProperties` accepts regular expressions }
ja_jp: quarkus { cachingRelevantProperties.add("FOO_MESSAGE") // 注記: `cachingRelevantProperties` は正規表現を受け入れます }

source: quarkus-bootstrap-maven-plugin deprecated in favor of quarkus-extension-maven-plugin
ja_jp: quarkus-bootstrap-maven-pluginは非推奨となり、quarkus-extension-maven-pluginが使用されるようになりました。

# quarkus.lambda-http.cognito-claim-matcher=[^[] ]+
source: quarkus.lambda-http.cognito-claim-matcher=[^\[\] \t]+
ja_jp: quarkus.lambda-http.cognito-claim-matcher=[^\[\] \ ]+
